apku04/stm32_saturn/firmware/src/system/terminal.c
/*
 * terminal.c — USB command parser and menu interface
 * Ported from PIC24 — replaced sprintf with snprintf, removed PIC24-specifics
 */

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdlib.h>
#include "terminal.h"
#include "stm32u0.h"
#include "radio.h"
#include "timer.h"
#include "hal.h"
#include "maclayer.h"
#include "networklayer.h"
#include "flash_config.h"
#include "packetBuffer.h"
#include "adc.h"
#include "ina219.h"
#include "i2c.h"
#include "bb_i2c.h"
#include "bme280.h"
#include "sht3x.h"
#include "flash_ota.h"
#include "gps.h"
#include "ext_flash.h"
#include "event_log.h"

uint8_t sniffer = 0;

#define MAX_ARGV 128

static uint16_t parseArgs(uint8_t *str, uint8_t *argv[]);
static void help_command(void);
static void get_commands(uint16_t argc, uint8_t *argv[]);
static void send_commands(uint16_t argc, uint8_t *argv[]);
static uint8_t set_commands(uint16_t argc, uint8_t *argv[]);
static void ping_commands(void);
static void menu(uint16_t argc, uint8_t *argv[]);
static void set_frequency(uint32_t freq);
static void set_data_rate(uint8_t data_rate);
static void set_tx_power(uint8_t power);
static void set_macAddr(uint8_t mac_addr);
static void softwareReset(void);
static void jump_to_bootloader(void);

static deviceData_t flash_data;
static ulme Ulme;

static uint8_t beacon_flag_val = 1;
void send_beacon_flag(uint8_t flag) { beacon_flag_val = flag; }
uint8_t get_beacon_flag(void) { return beacon_flag_val; }

void terminal(uint8_t *msg, uint8_t size) {
    uint8_t cmdStr[MAX_ARGV];
    uint8_t *argv[MAX_ARGV];
    uint16_t argc;

    if (size >= MAX_ARGV) size = MAX_ARGV - 1;
    memcpy(cmdStr, msg, size);
    cmdStr[size] = '\0';
    argc = parseArgs(cmdStr, argv);
    menu(argc, argv);
}

void user_layer_init(PacketBuffer *pTxBuf) {
    Ulme.pktTxBuf = pTxBuf;
}

static uint16_t parseArgs(uint8_t *str, uint8_t *argv[]) {
    uint16_t argc = 0;
    uint8_t *ch = str;

    if (*ch == '\r' || *ch == '\n' || *ch == '\0') return 0;
    while (*ch == ' ') ch++;

    argv[argc++] = ch;
    while (*ch != ' ' && *ch != '\0' && *ch != '\r' && *ch != '\n') ch++;
    if (*ch == ' ' || *ch == '\r' || *ch == '\n') {
        *ch++ = '\0';
        while (*ch == ' ') ch++;
    }

    while (*ch != '\0' && *ch != '\r' && *ch != '\n') {
        argv[argc++] = ch;
        while (*ch != ' ' && *ch != '\0' && *ch != '\r' && *ch != '\n') ch++;
        if (*ch == ' ' || *ch == '\r' || *ch == '\n') {
            *ch++ = '\0';
            while (*ch == ' ' && *ch != '\0') ch++;
        }
    }
    return argc;
}

static void menu(uint16_t argc, uint8_t *argv[]) {
    char s[200];

    if (!argc) return;

    const char *cmd = (const char *)argv[0];

    if (strcmp(cmd, "help") == 0) {
        help_command();
    } else if (strcmp(cmd, "get") == 0) {
        get_commands(argc, argv);
    } else if (strcmp(cmd, "set") == 0) {
        set_commands(argc, argv);
    } else if (strcmp(cmd, "send") == 0) {
        send_commands(argc, argv);
    } else if (strcmp(cmd, "reset") == 0) {
        softwareReset();
    } else if (strcmp(cmd, "clear") == 0 && argc >= 2 &&
               strcmp((const char *)argv[1], "log") == 0) {
        /* `clear log` — wipe the persistent boot/reset event log. */
        event_log_clear();
        print("event log cleared\n");
    } else if (strcmp(cmd, "dfu") == 0) {
        jump_to_bootloader();
    } else if (strcmp(cmd, "version") == 0) {
        print("STM32_LORA_V1\n");
    } else if (strcmp(cmd, "ping") == 0) {
        ping_commands();
    } else {
        snprintf(s, sizeof(s), "Error: unknown cmd: %s\n", argv[0]);
        print(s);
        print("Type <help> for available commands\n");
    }
}

static void help_command(void) {
    print("Commands:\n"
          "  help - This message\n"
          "  get <param>\n"
          "  set <param> <value>\n"
          "  send <message>\n"
          "  send cfg pwr <N>          remote: set tx_power (1..22)\n"
          "  send cfg sf  <N>          remote: set SF (5..12)\n"
          "  send cfg both <pwr> <sf>  remote: set both\n"
          "  ping\n"
          "  version\n"
          "  reset\n"
          "  dfu - Enter USB DFU bootloader\n"
          "Params: frequency, data_rate, tx_power, mac_address, flash, routing, battery, solar, charge\n");
}

static uint8_t set_commands(uint16_t argc, uint8_t *argv[]) {
    char s[200];

    if (argc >= 2 && strcmp((const char *)argv[1], "flash") == 0) {
        writeFlash(&flash_data);
        print("Done\n");
        return 0;
    }

    /* --- BOR (Brown-Out Reset) one-time option byte programming ---
     * Usage: set bor <0..3>
     *   0 = BOR Level 1 (~1.7 V)  -- effectively off
     *   1 = BOR Level 2 (~2.0 V)
     *   2 = BOR Level 3 (~2.5 V)  -- recommended for solar+Li-ion node
     *   3 = BOR Level 4 (~2.7 V)
     * After programming, OBL_LAUNCH triggers a reset and the new
     * threshold is enforced on every subsequent power cycle.
     * This is permanent (survives flash erase/reprogram).
     */
    if (argc >= 3 && strcmp((const char *)argv[1], "bor") == 0) {
        uint8_t lev = (uint8_t)atoi((const char *)argv[2]);
        if (lev > 3) { print("Error: bor must be 0..3\n"); return 1; }

        /* Wait for any flash op to settle */
        while (FLASH_SR & FLASH_SR_BSY);

        /* Unlock flash control */
        if (FLASH_CR & FLASH_CR_LOCK) {
            FLASH_KEYR = FLASH_KEY1;
            FLASH_KEYR = FLASH_KEY2;
        }
        /* Unlock option bytes */
        FLASH_OPTKEYR = FLASH_OPTKEY1;
        FLASH_OPTKEYR = FLASH_OPTKEY2;

        if (FLASH_CR & FLASH_CR_OPTLOCK) {
            print("Error: option bytes still locked\n");
            FLASH_CR |= FLASH_CR_LOCK;
            return 1;
        }

        /* Read-modify-write OPTR: enable BOR + set level */
        uint32_t optr = FLASH_OPTR;
        optr |=  FLASH_OPTR_BOR_EN;
        optr &= ~FLASH_OPTR_BOR_LEV_MSK;
        optr |=  ((uint32_t)lev << FLASH_OPTR_BOR_LEV_POS) & FLASH_OPTR_BOR_LEV_MSK;
        FLASH_OPTR = optr;

