apku04/stm32_saturn/firmware/src/system/terminal.c
        /* Trigger option byte program */
        FLASH_CR |= FLASH_CR_OPTSTRT;
        while (FLASH_SR & FLASH_SR_BSY);

        snprintf(s, sizeof(s),
                 "BOR programmed: level=%u OPTR=0x%08lX\n"
                 "Triggering OBL_LAUNCH (board will reset)...\n",
                 lev, (unsigned long)FLASH_OPTR);
        print(s);

        /* OBL_LAUNCH: reload option bytes from flash → MCU resets */
        FLASH_CR |= FLASH_CR_OBL_LAUNCH;
        /* Should never reach here */
        while (1);
    }

    /* --- OTA commands --- */
    if (argc >= 2 && strcmp((const char *)argv[1], "ota") == 0) {
        if (argc >= 3 && strcmp((const char *)argv[2], "erase") == 0) {
            ota_err_t rc = ota_erase();
            print(rc == OTA_OK ? "OTA Erase: OK\r\n" : "OTA Erase: FAIL\r\n");
            return 0;
        }
        if (argc >= 5 && strcmp((const char *)argv[2], "write") == 0) {
            uint32_t offset = strtoul((const char *)argv[3], NULL, 16);
            const char *hex = (const char *)argv[4];
            if (strlen(hex) != 16) {
                print("OTA Write: FAIL err=-2\r\n");
                return 1;
            }
            uint8_t data[8];
            for (int i = 0; i < 8; i++) {
                char tmp[3] = { hex[i*2], hex[i*2+1], '\0' };
                data[i] = (uint8_t)strtoul(tmp, NULL, 16);
            }
            ota_err_t rc = ota_write(offset, data, 8);
            if (rc == OTA_OK) {
                print("OTA Write: OK\r\n");
            } else {
                char s[64];
                snprintf(s, sizeof(s), "OTA Write: FAIL err=%d\r\n", (int)rc);
                print(s);
            }
            return 0;
        }
        if (argc >= 4 && strcmp((const char *)argv[2], "pending") == 0) {
            uint16_t sz = (uint16_t)strtoul((const char *)argv[3], NULL, 10);
            ota_set_pending(sz);
            print("OTA Pending: SET\r\n");
            return 0;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "clear") == 0) {
            ota_clear_pending();
            print("OTA Pending: CLEARED\r\n");
            return 0;
        }
        print("Unknown OTA set command\n");
        return 1;
    }

    if (argc >= 3) {
        if (strcmp((const char *)argv[1], "frequency") == 0) {
            uint32_t freq = strtol((const char *)argv[2], NULL, 10);
            if (freq == 444000000 || freq == 868000000 || freq == 870000000) {
                set_frequency(freq);
                flash_data.radioFreq1 = (freq >> 24) & 0xFF;
                flash_data.radioFreq2 = (freq >> 16) & 0xFF;
                flash_data.radioFreq3 = (freq >> 8) & 0xFF;
                flash_data.radioFreq4 = freq & 0xFF;
            } else {
                snprintf(s, sizeof(s), "Error: frequency must be 444000000, 868000000 or 870000000\n");
                print(s);
                return 1;
            }
        } else if (strcmp((const char *)argv[1], "data_rate") == 0) {
            uint8_t dr = strtol((const char *)argv[2], NULL, 10);
            if (dr >= 5 && dr <= 12) {
                set_data_rate(dr);
                flash_data.radioDataRate = dr;
            } else {
                print("Error: data_rate must be 5-12\n");
                return 1;
            }
        } else if (strcmp((const char *)argv[1], "tx_power") == 0) {
            uint8_t pw = strtol((const char *)argv[2], NULL, 10);
            if (pw >= 1 && pw <= 22) {
                set_tx_power(pw);
                flash_data.radioTxPwr = pw;
            } else {
                print("Error: tx_power must be 1-22\n");
                return 1;
            }
        } else if (strcmp((const char *)argv[1], "mac_address") == 0) {
            uint8_t addr = strtol((const char *)argv[2], NULL, 10);
            set_macAddr(addr);
            flash_data.deviceID = addr;
        } else if (strcmp((const char *)argv[1], "beacon") == 0) {
            uint8_t b = strtol((const char *)argv[2], NULL, 10);
            if (b == 0 || b == 1) send_beacon_flag(b);
            print("Done\n");
        } else {
            print("Unknown parameter\n");
        }
    } else {
        print("Insufficient arguments\n");
    }
    return 0;
}

static void get_commands(uint16_t argc, uint8_t *argv[]) {
    char buf[128];

    if (argc <= 1) return;

    if (strcmp((const char *)argv[1], "frequency") == 0) {
        uint32_t freq = radio_get_channel();
        snprintf(buf, sizeof(buf), "Frequency: %lu Hz\n", (unsigned long)freq);
        print(buf);
    } else if (strcmp((const char *)argv[1], "data_rate") == 0) {
        snprintf(buf, sizeof(buf), "Data Rate: %u\n", radio_get_datarate());
        print(buf);
    } else if (strcmp((const char *)argv[1], "tx_power") == 0) {
        snprintf(buf, sizeof(buf), "TX Power: %u\n", radio_get_tx_power());
        print(buf);
    } else if (strcmp((const char *)argv[1], "mac_address") == 0) {
        snprintf(buf, sizeof(buf), "MAC Address: %u\n", get_mac_address());
        print(buf);
    } else if (strcmp((const char *)argv[1], "uid") == 0) {
        const volatile uint8_t *p = (const volatile uint8_t *)UID_BASE;
        snprintf(buf, sizeof(buf),
                 "UID: %02X%02X%02X%02X %02X%02X%02X%02X %02X%02X%02X%02X\n",
                 p[0],p[1],p[2],p[3], p[4],p[5],p[6],p[7], p[8],p[9],p[10],p[11]);
        print(buf);

    } else if (strcmp((const char *)argv[1], "bor") == 0) {
        uint32_t optr = FLASH_OPTR;
        uint8_t en  = (optr & FLASH_OPTR_BOR_EN) ? 1 : 0;
        uint8_t lev = (uint8_t)((optr & FLASH_OPTR_BOR_LEV_MSK) >> FLASH_OPTR_BOR_LEV_POS);
        const char *t[4] = { "~1.7V (off)", "~2.0V", "~2.5V", "~2.7V" };
        snprintf(buf, sizeof(buf),
                 "BOR: en=%u level=%u (%s) OPTR=0x%08lX\n",
                 en, lev, t[lev], (unsigned long)optr);
        print(buf);
    } else if (strcmp((const char *)argv[1], "flash") == 0) {
        deviceData_t fData;
        uint8_t *p = (uint8_t *)&fData;
        const uint8_t ids[] = { DEVICE_ID, RADIO_FREQ1, RADIO_FREQ2, RADIO_FREQ3,
                                RADIO_FREQ4, RADIO_DR, RADIO_TX_PWR };
        for (int i = 0; i < (int)(sizeof(ids)/sizeof(ids[0])); i++)
            readFlash(ids[i], p + i);

        uint32_t freq = ((uint32_t)fData.radioFreq1 << 24) |
                        ((uint32_t)fData.radioFreq2 << 16) |
                        ((uint32_t)fData.radioFreq3 << 8) |
                        (uint32_t)fData.radioFreq4;
        snprintf(buf, sizeof(buf),
                 "\nFlash Data\nFrequency: %lu Hz\nData Rate: %u\n"
                 "TX Power: %u\nMAC Address: %u\n",
                 (unsigned long)freq, fData.radioDataRate,
                 fData.radioTxPwr, fData.deviceID);
        print(buf);
    } else if (strcmp((const char *)argv[1], "routing") == 0) {
        print_routing_table();
    } else if (strcmp((const char *)argv[1], "gps") == 0) {
        if (argc >= 3 && strcmp((const char *)argv[2], "reinit") == 0) {
            gps_init();
            print("GPS reinitialised\n");
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "raw") == 0) {
            uint8_t on = (argc >= 4) ? (uint8_t)atoi((const char *)argv[3]) : 1;
            gps_set_raw_echo(on);
            snprintf(buf, sizeof(buf), "GPS raw echo: %u\n", on);
            print(buf);
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "baud") == 0 && argc >= 4) {
            uint32_t b = strtoul((const char *)argv[3], NULL, 10);
            gps_set_baud(b);
            snprintf(buf, sizeof(buf), "GPS baud: %lu\n", (unsigned long)b);
            print(buf);
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "af") == 0 && argc >= 4) {
            uint8_t a = (uint8_t)atoi((const char *)argv[3]);
            gps_set_af(a);
            snprintf(buf, sizeof(buf), "GPS AF: %u\n", a);
            print(buf);
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "probe") == 0) {
            uint32_t r = gps_probe_pa3();
            uint32_t trans = r & 0xFFFFu;
            uint32_t lows  = r >> 16;
            snprintf(buf, sizeof(buf),
                     "PA3 probe (~1s): transitions=%lu  low_samples=%lu (clamp 65535)\n",
                     (unsigned long)trans, (unsigned long)lows);
            print(buf);
            return;
        }
        const gps_fix_t *f = gps_get_fix();
        char nbuf[110];
        gps_get_last_nmea(nbuf, sizeof(nbuf));
        uint32_t toggles = 0;
        uint32_t isr = gps_diag(&toggles);
        snprintf(buf, sizeof(buf),
                 "GPS sentences=%lu fix=%u sats=%u "
                 "lat=%ld.%06ld lon=%ld.%06ld alt=%dm time=%06lu\n",
                 (unsigned long)f->sentences, f->fix_quality, f->sats,
                 (long)(f->lat_udeg / 1000000), (long)(f->lat_udeg < 0 ? -f->lat_udeg : f->lat_udeg) % 1000000,
                 (long)(f->lon_udeg / 1000000), (long)(f->lon_udeg < 0 ? -f->lon_udeg : f->lon_udeg) % 1000000,
                 f->alt_m, (unsigned long)f->time_hms);
        print(buf);
        snprintf(buf, sizeof(buf),
                 "GPS diag: USART2_ISR=0x%08lX PA2_lvl=%u PA3_lvl=%u (1.5s)\n",
                 (unsigned long)isr,
                 (unsigned)((toggles >> 0) & 1u),
                 (unsigned)((toggles >> 1) & 1u));
        print(buf);
        snprintf(buf, sizeof(buf),
                 "GPS pin: PA2 mod=%u af=%u pu=%u  PA3 mod=%u af=%u pu=%u\n",
                 (unsigned)((toggles >> 4)  & 3u),
                 (unsigned)((toggles >> 8)  & 0xFu),
                 (unsigned)((toggles >> 16) & 3u),
                 (unsigned)((toggles >> 6)  & 3u),
                 (unsigned)((toggles >> 12) & 0xFu),
                 (unsigned)((toggles >> 18) & 3u));
        print(buf);
        if (nbuf[0]) {
            snprintf(buf, sizeof(buf), "GPS last NMEA: %s\n", nbuf);
            print(buf);
        }
        uint32_t ic, rn, fe2;
        gps_isr_stats(&ic, &rn, &fe2);
        snprintf(buf, sizeof(buf),
                 "GPS ISR: calls=%lu rxne=%lu fe=%lu CR1=0x%08lX BRR=%lu NVIC=0x%08lX\n",
                 (unsigned long)ic, (unsigned long)rn, (unsigned long)fe2,
                 (unsigned long)gps_get_cr1(), (unsigned long)gps_get_brr(),
                 (unsigned long)gps_get_nvic());
        print(buf);
    } else if (strcmp((const char *)argv[1], "battery") == 0) {
        uint16_t raw = adc_read_battery_raw();
        uint32_t mv = ((uint32_t)raw * 6600UL) / 4096UL;
        snprintf(buf, sizeof(buf), "Battery: %lu mV (raw: %u)\n", (unsigned long)mv, raw);
        print(buf);
    } else if (strcmp((const char *)argv[1], "solar") == 0) {
        /* Full solar/charger readout from U10 INA219.
         * Shunt R = 0.05 Ω (R58, 50mΩ ±1%) → I[mA] = V_shunt[µV] / 50 */
        uint16_t bus_mv  = ina219_read_bus_mv();
        int32_t  sh_uv   = ina219_read_shunt_uv();
        int32_t  i_ma    = sh_uv / 50;
        int32_t  p_mw    = ((int32_t)bus_mv * i_ma) / 1000;
        ChargeStatus cs  = charge_get_status();
        snprintf(buf, sizeof(buf),
                 "Solar:  bus=%u mV  shunt=%ld µV  I=%ld mA  P=%ld mW  charge=%s\n",
                 bus_mv, (long)sh_uv, (long)i_ma, (long)p_mw, charge_status_str(cs));
        print(buf);
    } else if (strcmp((const char *)argv[1], "charge") == 0) {
        ChargeStatus s = charge_get_status();
        snprintf(buf, sizeof(buf), "Charge: %s\n", charge_status_str(s));
        print(buf);
    } else if (strcmp((const char *)argv[1], "vrefint") == 0) {
        /* Read 4 samples; report each + average to expose any glitch */
        uint16_t s[4];
        uint32_t sum = 0;
        for (int i = 0; i < 4; i++) { s[i] = adc_read_vrefint_raw(); sum += s[i]; }
        uint16_t avg = (uint16_t)(sum / 4);
        uint16_t vdda = adc_vdda_from_raw(avg);
        uint16_t cal = *(volatile uint16_t *)0x1FFF6E68u;
        snprintf(buf, sizeof(buf),
                 "VREFINT raws: %u %u %u %u  avg=%u  CAL=%u  VDDA=%u mV\n",
                 s[0], s[1], s[2], s[3], avg, cal, vdda);
        print(buf);
    } else if (strcmp((const char *)argv[1], "ina") == 0) {
        /* Write config register and report I2C result */
        int wret = i2c2_write_reg(0x40, 0x00, 0x399F);
        snprintf(buf, sizeof(buf), "INA219 config write: %d\n", wret);
        print(buf);
        uint16_t raw_shunt = 0, raw_bus = 0;
        int sr = i2c2_read_reg(0x40, 0x01, &raw_shunt);
        int br = i2c2_read_reg(0x40, 0x02, &raw_bus);
        snprintf(buf, sizeof(buf),
                 "shunt reg: ret=%d raw=0x%04X (%d mV)\n"
                 "bus   reg: ret=%d raw=0x%04X (%u mV)\n",
                 sr, raw_shunt, (int16_t)raw_shunt / 100,
                 br, raw_bus, (raw_bus >> 3) * 4);
        print(buf);
    } else if (strcmp((const char *)argv[1], "i2cscan") == 0) {
        print("Scanning I2C2 (0x08-0x77)...\n");
        for (uint8_t a = 0x08; a <= 0x77; a++) {
            uint8_t dummy;
            if (i2c2_read(a, &dummy, 1) == 0) {
                snprintf(buf, sizeof(buf), "  Found: 0x%02X\n", a);
                print(buf);
            }
        }
        print("Done\n");
    } else if (strcmp((const char *)argv[1], "bbscan") == 0) {
        /* First report idle line levels — empty bbscan with both lines high
         * means slaves are dead/missing; SCL=0 means hardware fault that
         * software can't recover from. */
        uint8_t scl = 0, sda = 0;
        bb_i2c_probe_idle(&scl, &sda);
        snprintf(buf, sizeof(buf),
                 "bb_i2c idle: SCL=%u SDA=%u  (both should be 1)\n", scl, sda);
        print(buf);
        print("Scanning bit-bang I2C (PB6/PB7)...\n");
        for (uint8_t a = 0x08; a <= 0x77; a++) {
            uint8_t dummy;
            if (bb_i2c_read(a, &dummy, 1) == 0) {
                snprintf(buf, sizeof(buf), "  Found: 0x%02X\n", a);
                print(buf);
            }
        }
        print("Done\n");
    } else if (strcmp((const char *)argv[1], "bme") == 0) {
        /* Diagnostic: dump BME280 chip id, raw H bytes, calibration H regs,
         * and the compensated values from a fresh sample. */
        uint8_t id = 0xFF;
        for (uint8_t a = 0x76; a <= 0x77; a++) {
            if (bb_i2c_write_then_read(a, 0xD0, &id, 1) == 0) {
                snprintf(buf, sizeof(buf),
                         "BME @0x%02X chip_id=0x%02X (%s)\n",
                         a, id,
                         id == 0x60 ? "BME280" :
                         id == 0x58 ? "BMP280 (NO HUMIDITY)" :
                         id == 0x61 ? "BME680" : "unknown");
                print(buf);
            }
        }
        uint8_t h1 = 0, h27[7] = {0}, raw[8] = {0};
        bb_i2c_write_then_read(0x76, 0xA1, &h1, 1);
        bb_i2c_write_then_read(0x76, 0xE1, h27, 7);
        snprintf(buf, sizeof(buf),
                 "calib: H1=%u  E1..E7=%02X %02X %02X %02X %02X %02X %02X\n",
                 h1, h27[0], h27[1], h27[2], h27[3], h27[4], h27[5], h27[6]);
        print(buf);
        bme280_sample();
        bb_i2c_write_then_read(0x76, 0xF7, raw, 8);
        snprintf(buf, sizeof(buf),
                 "raw F7..FE: %02X %02X %02X %02X %02X %02X %02X %02X\n",
                 raw[0], raw[1], raw[2], raw[3],
                 raw[4], raw[5], raw[6], raw[7]);
        print(buf);
        snprintf(buf, sizeof(buf), "T=%d cdeg  H=%u cpct  present=%d\n",
                 bme280_get_temp_cdeg(), bme280_get_hum_cpct(),
                 bme280_present());
        print(buf);
    } else if (strcmp((const char *)argv[1], "sht") == 0) {
        snprintf(buf, sizeof(buf), "SHT3x present=%d\n", sht3x_present());
        print(buf);
        if (sht3x_present()) {
            int r = sht3x_sample();
            snprintf(buf, sizeof(buf),
                     "sample ret=%d  T=%d cdeg  H=%u cpct\n",
                     r, sht3x_get_temp_cdeg(), sht3x_get_hum_cpct());
            print(buf);
        }
    } else if (strcmp((const char *)argv[1], "adcscan") == 0) {
        print("ADC scan ch0-19:\n");
        for (uint8_t ch = 0; ch <= 19; ch++) {
            uint16_t raw = adc_read_channel_raw(ch);
            if (raw > 20) {
                uint32_t mv = ((uint32_t)raw * 3300UL) / 4096UL;
                snprintf(buf, sizeof(buf), "  CH%02u: raw=%4u  pin=%4lumV\n", ch, raw, (unsigned long)mv);
                print(buf);
            }
        }
        uint16_t bat = adc_read_battery_mv();
        uint16_t braw = adc_read_battery_raw();
        snprintf(buf, sizeof(buf), "bat_mv=%u (raw=%u)\n", bat, braw);
        print(buf);
    } else if (strcmp((const char *)argv[1], "ota") == 0) {
        if (argc >= 3 && strcmp((const char *)argv[2], "bank") == 0) {
            snprintf(buf, sizeof(buf), "OTA Bank: 0x%08lX size=%lu\r\n",
                     (unsigned long)ota_bank_addr(), (unsigned long)ota_bank_size());
            print(buf);
        } else if (argc >= 5 && strcmp((const char *)argv[2], "read") == 0) {
            uint32_t offset = strtoul((const char *)argv[3], NULL, 16);
            uint32_t len = strtoul((const char *)argv[4], NULL, 10);
            if (len > 16) len = 16;
            uint8_t tmp[16];
            ota_read(offset, tmp, len);
            print("OTA Read:");
            for (uint32_t i = 0; i < len; i++) {
                char hx[4];
                snprintf(hx, sizeof(hx), " %02X", tmp[i]);
                print(hx);
            }
            print("\r\n");
        } else if (argc >= 3 && strcmp((const char *)argv[2], "pending") == 0) {
            uint16_t img_sz = 0;
            if (ota_is_pending(&img_sz)) {
                snprintf(buf, sizeof(buf), "OTA Pending: YES size=%u\r\n", img_sz);
            } else {
                snprintf(buf, sizeof(buf), "OTA Pending: NO\r\n");
            }
            print(buf);
        }
    } else if (strcmp((const char *)argv[1], "extflash") == 0) {
        uint32_t id = ext_flash_read_id();
        snprintf(buf, sizeof(buf), "JEDEC ID: 0x%06lX (%s)\n",
                 (unsigned long)id,
                 id == 0xEF4016 ? "W25Q32" : "unknown");
        print(buf);

        /* Write/read test at the LAST sector — sector 0 is reserved for the
         * persistent boot event log, so we mustn't erase it here. The W25Q32
         * is 4 MB; last sector starts at (4 MB - 4 KB) = 0x3FF000. */
        uint32_t test_addr = EXT_FLASH_TOTAL_SIZE - EXT_FLASH_SECTOR_SIZE;
        ext_flash_erase_sector(test_addr);
        uint8_t wr[16] = {0xDE,0xAD,0xBE,0xEF, 0x01,0x02,0x03,0x04,
                          0xA5,0x5A,0x55,0xAA, 0x12,0x34,0x56,0x78};
        ext_flash_write(test_addr, wr, 16);
        uint8_t rd[16];
        ext_flash_read(test_addr, rd, 16);
        int pass = 1;
        for (int i = 0; i < 16; i++) {
            if (rd[i] != wr[i]) { pass = 0; break; }
        }
        snprintf(buf, sizeof(buf), "Write/Read test @0x%06lX: %s\n",
                 (unsigned long)test_addr, pass ? "PASS" : "FAIL");
        print(buf);
        print("Read: ");
        for (int i = 0; i < 16; i++) {
            char hx[4];
            snprintf(hx, sizeof(hx), "%02X ", rd[i]);
            print(hx);
        }
        print("\n");
    } else if (strcmp((const char *)argv[1], "log") == 0) {
        /* Dump the persistent boot/reset event log. One line per record;
         * fields match what the host already decodes from beacon v7 so the
         * same regex can parse this output offline. */
        snprintf(buf, sizeof(buf),
                 "event log: count=%lu head=%lu (cap=%u)\n",
                 (unsigned long)event_log_count(),
                 (unsigned long)event_log_head(),
                 EVENT_LOG_REC_COUNT);
        print(buf);
        for (uint32_t i = 0; i < EVENT_LOG_REC_COUNT; i++) {
            event_log_rec_t r;
            if (!event_log_read(i, &r))
                break;   /* slot empty → end of valid records */
            snprintf(buf, sizeof(buf),
                     "  [%lu] boot=%lu rst=0x%08lX last_stage=%u this_stage=%u "
                     "up_ms=%lu reached_main=%u\n",
                     (unsigned long)i,
                     (unsigned long)r.boot_count,
                     (unsigned long)r.rst_csr,
                     r.last_init_stage, r.this_init_stage,
                     (unsigned long)r.last_uptime_ms,
                     (r.flags & 0x0001) ? 1 : 0);
            print(buf);
        }
    } else if (strcmp((const char *)argv[1], "i2cread") == 0 && argc >= 4) {
        /* Usage: get i2cread <addr_hex> <reg_hex>
         * Reads a 16-bit big-endian register from an arbitrary I2C device.
         * Use to prove I2C read path with a known-good device on H4. */
        uint8_t addr = (uint8_t)strtoul((const char *)argv[2], NULL, 16);
        uint8_t reg  = (uint8_t)strtoul((const char *)argv[3], NULL, 16);
        uint16_t val = 0;
        int r = i2c2_read_reg(addr, reg, &val);
        snprintf(buf, sizeof(buf),
                 "i2c read  addr=0x%02X reg=0x%02X -> ret=%d val=0x%04X\n",
                 addr, reg, r, val);
        print(buf);
    }
}

